## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_security_group.cra_upd_docdb_egress_sg`                          |
|        | `aws_security_group.cra_upd_docdb_sg`                                 |
|        | `module.cra_upd_documentdb.aws_docdb_cluster.this[0]`                 |
|        | `module.cra_upd_documentdb.aws_docdb_cluster_instance.this[0]`        |
|        | `module.cra_upd_documentdb.aws_docdb_cluster_parameter_group.this[0]` |
|        | `module.cra_upd_documentdb.aws_docdb_subnet_group.this[0]`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.cra_upd_docdb_egress_sg will be created
  + resource "aws_security_group" "cra_upd_docdb_egress_sg" {
      + arn                    = (known after apply)
      + description            = "Allow egress to DocumentDB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-docdb-egress-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0d40e1aa75cc8f4c2"
    }

  # aws_security_group.cra_upd_docdb_sg will be created
  + resource "aws_security_group" "cra_upd_docdb_sg" {
      + arn                    = (known after apply)
      + description            = "Ingress to DocumentDB Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow ingress to DocumentDB"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "cra-upd-docdb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0d40e1aa75cc8f4c2"
    }

  # module.cra_upd_documentdb.aws_docdb_cluster.this[0] will be created
  + resource "aws_docdb_cluster" "this" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 7
      + cluster_identifier              = "upd"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = "parameter-group-upd"
      + db_subnet_group_name            = "subnet-group-upd"
      + deletion_protection             = true
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = "8.0.0"
      + final_snapshot_identifier       = "upd"
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_password_wo              = (write-only attribute)
      + master_user_secret              = (known after apply)
      + master_username                 = (sensitive value)
      + port                            = 27017
      + preferred_backup_window         = "11:00-12:00"
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + storage_type                    = "iopt1"
      + tags                            = {
          + "CostCentre" = "cra-upd-dashboard"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + vpc_security_group_ids          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.cra_upd_documentdb.aws_docdb_cluster_instance.this[0] will be created
  + resource "aws_docdb_cluster_instance" "this" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "upd-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r6gd.xlarge"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "CostCentre" = "cra-upd-dashboard"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + writer                          = (known after apply)
    }

  # module.cra_upd_documentdb.aws_docdb_cluster_parameter_group.this[0] will be created
  + resource "aws_docdb_cluster_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "DB cluster parameter group."
      + family      = "docdb8.0"
      + id          = (known after apply)
      + name        = "parameter-group-upd"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "cra-upd-dashboard"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "default_collection_compression"
          + value        = "zstd"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "profiler"
          + value        = "disabled"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "tls"
          + value        = "enabled"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "ttl_monitor"
          + value        = "disabled"
        }
    }

  # module.cra_upd_documentdb.aws_docdb_subnet_group.this[0] will be created
  + resource "aws_docdb_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "DB subnet group for the DB Cluster instances."
      + id          = (known after apply)
      + name        = "subnet-group-upd"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-01aa8b110c3284c87",
          + "subnet-050cdd08641ad8450",
        ]
      + tags        = {
          + "CostCentre" = "cra-upd-dashboard"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + docdb_cluster_arn  = (known after apply)
  + docdb_cluster_id   = (known after apply)
  + docdb_egress_sg_id = (known after apply)
  + docdb_endpoint     = (sensitive value)
  + docdb_sg_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_docdb_egress_sg"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_docdb_sg"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
